# IsValidApprovalTypeName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionApprovalType..::..IsValidApprovalTypeName Method
StructuralConnectionApprovalType Class See Also
---
Verifies if the provided approval name is unique in the document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static bool IsValidApprovalTypeName(
	Document doc,
	string name
)
```

Visual Basic
---
```text
Public Shared Function IsValidApprovalTypeName ( _
	doc As Document, _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidApprovalTypeName(
	Document^ doc,
	String^ name
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document
name
    Type: System..::..String
# ### Return Value
True if approval type name is unique.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace